# FaceRegionCreationFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..FaceRegionCreationFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failure in face region creation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceRegionCreationFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceRegionCreationFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceRegionCreationFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace